Revit 2027 API
BuiltInFailures.CurtainWallFailures.CannotUseCornerMullion Property
 Corner Mullions must be placed at a location that can have neighboring Panels that are not tangent. With the exception of Wall Join locations, Corner Mullions are not currently supported on the external boundaries of Curtain elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotUseCornerMullion { get; }
Public Shared ReadOnly Property CannotUseCornerMullion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotUseCornerMullion {
	FailureDefinitionId^ get ();
}
static member CannotUseCornerMullion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace